fbb-drafting-tool/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "admin@fakemail.com"], ["LIMIT", 1]]
---
    def handle_login email, password
        @user = User.find_by_email(email)