fbb-drafting-tool/app/controllers/available_players_controller.rb

  def index
    @available_players = AvailablePlayer.all
---
SELECT "team_players".* FROM "team_players"
SELECT "available_players".* FROM "available_players"

  def destroy
    @available_player.destroy
---
DELETE FROM "available_players" WHERE "available_players"."id" = $1  [["id", 1]]

    def set_available_player
      @available_player = AvailablePlayer.find(params[:id])
---
SELECT  "available_players".* FROM "available_players" WHERE "available_players"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]