fbb-drafting-tool/app/controllers/team_players_controller.rb

SELECT  "team_players".* FROM "team_players" WHERE "team_players"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def set_team_player
      @team_player = TeamPlayer.find(params[:id])