fbb-drafting-tool/app/controllers/team_players_controller.rb

  def index
    @team_players = TeamPlayer.all
---
SELECT "team_players".* FROM "team_players"

  def create
    team = Team.find params[:team_id]

    team.team_players << TeamPlayer.new(team_player_params)

    render json: {team_player: team.team_players.last}
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "team_players" ("first_name", "last_name", "position", "points", "assists", "rebounds", "threes", "field_goal_pct", "free_throw_pct", "steals", "blocks", "turnovers", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
SELECT  "team_players".* FROM "team_players" WHERE "team_players"."team_id" = $1 ORDER BY "team_players"."id" DESC LIMIT $2  [["team_id", 1], ["LIMIT", 1]]